In [1]:
phrase = "Hello World!"
print(phrase)

Hello World!

In [2]:
pi = 3.14
radius = 2
area = pi*(radius**2)
print(f"The area of the circle with radius of {radius} is {area}")

The area of the circle with radius of 2 is 12.56

In [4]:
filename = 'here_is_a_file.csv'
filename = filename[:-4]
print(filename)

here_is_a_file

In [9]:
slice_this_phrase = 'dog cat racoon'
print(slice_this_phrase[0:3])
print(slice_this_phrase[4:7])
print(slice_this_phrase[-6:])

dog
cat
racoon

In [11]:
list_1 = [1, 2, 3, 4, 5, radius, area]
print(list_1)

[1, 2, 3, 4, 5, 2, 12.56]

In [17]:
favourite_colour = 'black'
colours_list = ['red', 'blue', 'green']
colours_list.append(favourite_colour)
print(f"My colours are {colours_list}")

My colours are ['red', 'blue', 'green', 'black']

In [1]:
foods_list = ['chicken', 'fish', 'eggs']
print(foods_list)
foods_list.append('soup')
print(foods_list)

['chicken', 'fish', 'eggs']
['chicken', 'fish', 'eggs', 'soup']

In [2]:
foods_list_extended = ['pasta', 'rice']
foods_list.extend(foods_list_extended)
print(foods_list)
foods_list.remove('fish')
print(foods_list)

['chicken', 'fish', 'eggs', 'soup', 'pasta', 'rice']
['chicken', 'eggs', 'soup', 'pasta', 'rice']

In [4]:
foods_list_sorted = sorted(foods_list, reverse=True)
print(foods_list_sorted)

['soup', 'rice', 'pasta', 'eggs', 'chicken']

In [5]:
restaurant_dict = {
            'Noma':'Scandi',
            'MacDonalds':['burgers', 'fries'],
            'Brown''s Bar':{'French','Italian','Mexican'}
}
restaurant_dict[]
print(restaurant_dict)
print(restaurant_dict['Noma'])
print(restaurant_dict.values())
print(restaurant_dict.items())

{'Noma': 'Scandi', 'MacDonalds': ['burgers', 'fries'], 'Browns Bar': {'Italian', 'Mexican', 'French'}}
Scandi
dict_values(['Scandi', ['burgers', 'fries'], {'Italian', 'Mexican', 'French'}])
dict_items([('Noma', 'Scandi'), ('MacDonalds', ['burgers', 'fries']), ('Browns Bar', {'Italian', 'Mexican', 'French'})])

In [1]:
jobs = {'Al':'SQL Dev',
        'Mike':'Manager'}
job_titles = list(jobs.values())
job_titles_sorted = sorted(job_titles)
print(job_titles_sorted)
for x in range(len(job_titles_sorted)):
    print(job_titles_sorted[x])

['Manager', 'SQL Dev']
Manager
SQL Dev

In [7]:
jobs = {'Al':'SQL Dev',
        'Mike':'Data Analyst',
        'Bob':'Programmer',
        'Sue':'Project Manager',
        'Kate':'Senior Analyst',
        'Will':'IT Trainer',
        'Charlie':'Research Analyst'}
jobs_sorted = dict(sorted(jobs.items()))
print(jobs_sorted)
for key, values in jobs_sorted.items():
        print(f"My name is {key} and my position is {values}")

{'Al': 'SQL Dev', 'Bob': 'Programmer', 'Charlie': 'Research Analyst', 'Kate': 'Senior Analyst', 'Mike': 'Data Analyst', 'Sue': 'Project Manager', 'Will': 'IT Trainer'}
My name is Al and my position is SQL Dev
My name is Bob and my position is Programmer
My name is Charlie and my position is Research Analyst
My name is Kate and my position is Senior Analyst
My name is Mike and my position is Data Analyst
My name is Sue and my position is Project Manager
My name is Will and my position is IT Trainer

In [2]:
import pandas as pd

dict_1 = {"here's a column":['val 1', 'val 2', 'val 3'],
          "column 2":[4, 5, 6],
          "column z": ['foo', 'bar', 'baz']}

df_1 = pd.DataFrame(dict_1)
df_1

  here's a column  column 2 column z
0           val 1         4      foo
1           val 2         5      bar
2           val 3         6      baz

In [3]:
list_of_dicts = [{'letter':'A',
                  'word':'foo',
                  'number':'1'},
                  {'letter':'B',
                  'word':'bar',
                  'number':'2'},
                  {'letter':'C',
                  'word':'baz',
                  'number':'3'}]
df_2 = pd.DataFrame(list_of_dicts)
df_2

  letter word number
0      A  foo      1
1      B  bar      2
2      C  baz      3

In [5]:
employee_dict = [{'name':'mike jones','salary':45000,'job title':'analyst'},
                 {'name':'john smith','salary':60000,'job title':'senior analyst'},
                {'name':'jim carr','salary':25000,'job title':'research analyst'},
                {'name':'paul carter','salary':37500,'job title':'performance analyst'}]

df_emps = pd.DataFrame(employee_dict)
df_emps

          name  salary            job title
0   mike jones   45000              analyst
1   john smith   60000       senior analyst
2     jim carr   25000     research analyst
3  paul carter   37500  performance analyst

In [9]:
#print(df_emps.info())
#print(df_emps.dtypes)
# print(df_emps.head(1))
# print(df_emps.tail(1))

         name  salary job title
0  mike jones   45000   analyst
          name  salary            job title
3  paul carter   37500  performance analyst

In [12]:
df_emps['salary'] = df_emps['salary'].astype(int)
df_emps.dtypes

name         object
salary        int64
job title    object
dtype: object

In [39]:
df_emps['date started'] = ['05/12/1993','23/06/2022','15/03/1963','05/11/2023']
df_emps

,name,salary,job title,date started,pay after bonus,date of birth,time served
0,mike jones,51232.0050,analyst,05/12/1993,51732.0050,1973-06-04,10928 days
1,john smith,68309.3400,senior analyst,23/06/2022,68809.3400,2022-02-15,501 days
2,jim carr,28462.2250,research analyst,15/03/1963,28962.2250,1945-07-28,22151 days
3,paul carter,42693.3375,performance analyst,05/11/2023,43193.3375,1943-08-07,0 days

In [40]:
inflation = 1.067
df_emps['salary'] = df_emps['salary'] * inflation
df_emps
df_emps['pay after bonus'] = df_emps['salary'] + 500
df_emps

,name,salary,job title,date started,pay after bonus,date of birth,time served
0,mike jones,54664.549335,analyst,05/12/1993,55164.549335,1973-06-04,10928 days
1,john smith,72886.065780,senior analyst,23/06/2022,73386.065780,2022-02-15,501 days
2,jim carr,30369.194075,research analyst,15/03/1963,30869.194075,1945-07-28,22151 days
3,paul carter,45553.791113,performance analyst,05/11/2023,46053.791113,1943-08-07,0 days

In [41]:
df_emps['date started'] = pd.to_datetime(df_emps['date started'], format ='%d/%m/%Y')
df_emps

,name,salary,job title,date started,pay after bonus,date of birth,time served
0,mike jones,54664.549335,analyst,1993-12-05,55164.549335,1973-06-04,10928 days
1,john smith,72886.065780,senior analyst,2022-06-23,73386.065780,2022-02-15,501 days
2,jim carr,30369.194075,research analyst,1963-03-15,30869.194075,1945-07-28,22151 days
3,paul carter,45553.791113,performance analyst,2023-11-05,46053.791113,1943-08-07,0 days

In [44]:
df_emps['date of birth'] = ['04/06/1973','15/02/2022','28/07/1945','07/08/1943']
df_emps['date of birth'] = pd.to_datetime(df_emps['date of birth'], format ='%d/%m/%Y')
df_emps
df_emps['time served'] = pd.to_datetime('06/11/2023', format ='%d/%m/%Y')-df_emps['date started']
df_emps['time served'] = df_emps['time served'] / pd.Timedelta('365 days')
df_emps['time served'] = df_emps['time served'].round().astype('int', errors='ignore')
df_emps

,name,salary,job title,date started,pay after bonus,date of birth,time served
0,mike jones,54664.549335,analyst,1993-12-05,55164.549335,1973-06-04,30
1,john smith,72886.065780,senior analyst,2022-06-23,73386.065780,2022-02-15,1
2,jim carr,30369.194075,research analyst,1963-03-15,30869.194075,1945-07-28,61
3,paul carter,45553.791113,performance analyst,2023-11-05,46053.791113,1943-08-07,0